---
kind: enumMember
id: F:Autodesk.Revit.DB.MeshFromGeometryOperationIssue.EmptyCurveLoopsInInput
enum: Autodesk.Revit.DB.MeshFromGeometryOperationIssue
source: html/6c89d542-b05c-bbbf-eb8d-e291d71865d0.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationIssue.EmptyCurveLoopsInInput

Among curve loops expected as input parameters while building
 a mesh, some are empty.